bin/src/test/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.controlsaldo.ecobis.cobiscorp" xmlns:dto="http://dto.controlsaldo.ecobis.cobiscorp"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:UsernameToken><wsse:Username>franco.milanese</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"/></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><ser:ControlSaldoOp1><ser:inControlSaldoFil><dto:ifProceso>1</dto:ifProceso><dto:icCuenta>1</dto:icCuenta><dto:imSaldoSuficiente>1</dto:imSaldoSuficiente><dto:inUltSuc>1</dto:inUltSuc><dto:isUltLote>1</dto:isUltLote><dto:imCalculaFilas>1</dto:imCalculaFilas></ser:inControlSaldoFil></ser:ControlSaldoOp1></soapenv:Body></soapenv:Envelope>